# running in ufifo_prf/src/
read -formal -D UFIFO ufifo.v
prep -top ufifo

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
